Import dependencies

In [2]:
import pandas as pd
import os

Deliverable 1: Collect the Data

In [3]:
full_student_data = os.path.join('../Resources/new_full_student_data.csv')
student_df = pd.read_csv(full_student_data)
student_df.head()

,student_id,student_name,grade,school_name,reading_score,math_score,school_type,school_budget
0,103880842,Travis Martin,9th,Sullivan High School,59.0,88.2,Public,961125
1,45069750,Michael Brown,9th,Dixon High School,94.7,73.5,Charter,870334
2,45024902,Gabriela Lucero,9th,Wagner High School,89.0,70.4,Public,846745
3,62582498,Susan Richardson,9th,Silva High School,69.7,80.3,Public,991918
4,16437227,Sherry Davis,11th,Bowers High School,NaN,27.5,Public,848324

Deliverable 2: Prepare the Data

In [4]:
student_df.count()
#Indicates we have missing values

student_id       19514
student_name     19514
grade            19514
school_name      19514
reading_score    17546
math_score       18532
school_type      19514
school_budget    19514
dtype: int64

In [ ]:
student_df = student_df.dropna(how='any')
student_df.count()
student_df.head()

In [ ]:
student_df.duplicated()
student_df.duplicated().sum()

In [ ]:
student_df = student_df.drop_duplicates()
student_df.duplicated()

In [ ]:
student_df.dtypes

In [ ]:
student_df["grade"].value_counts()

In [ ]:
student_df['grade'] = student_df['grade'].replace(
    {'9th': 9, '10th': 10, '11th': 11, '12th': 12})

student_df["grade"].value_counts()

In [ ]:
#Column type is already int, but to change it it would be: student_df["grade"] = pd.to_numeric(student_df["grade"])
student_df["grade"].dtype

Deliverable 3: Summarize the Data

In [ ]:
student_df.describe()

In [ ]:
student_df["math_score"].mean()

In [ ]:
min_reading_score = student_df["reading_score"].min()
min_reading_score

Deliverable 4: Drill Down into the Data

In [ ]:
student_df.loc[:, "grade"]

In [ ]:
student_df.iloc[0:3,3:6]

In [ ]:
grade_9 = student_df.loc[student_df["grade"] == 9,:]
grade_9.describe()

In [ ]:
min_reading_row = student_df.loc[student_df["reading_score"] == min_reading_score,:]
min_reading_row

In [ ]:
grade10_reading = student_df.loc[(student_df["grade"] == 10) & (student_df["school_name"] == "Dixon High School") , ["school_name","reading_score"]]
grade10_reading

In [ ]:
grade11and12_reading = student_df.loc[(student_df["grade"] == 11) | (student_df["grade"] == 12), "reading_score"]
grade11and12_reading.mean()

Deliverable 5: Compare the Data